# Daily-Dose-of-Data-Science

[Daily Dose of Data Science](https://avichawla.substack.com) is a publication on Substack that brings together intriguing frameworks, libraries, technologies, and tips that make the life cycle of a Data Science project effortless. 

Author: Avi Chawla

[Medium](https://medium.com/@avi_chawla) | [LinkedIn](https://www.linkedin.com/in/avi-chawla/)

# 

Post Link: [Substack]()

LinkedIn Post: [LinkedIn]()

In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame([["Peter", 95], 
                   ["Jane", 100],
                   ["Mark", 97], 
                   ["David", 95]],
                   columns = ["Name", "Marks"])

In [17]:
df

    Name  Marks
0  Peter     95
1   Jane    100
2   Mark     97
3  David     95

In [19]:
df.sort_values("Marks", ascending=False).head(3)

    Name  Marks
1   Jane    100
2   Mark     97
0  Peter     95

In [20]:
df.nlargest(n=3, 
            columns="Marks", 
            keep="all")

    Name  Marks
1   Jane    100
2   Mark     97
0  Peter     95
3  David     95